Знакомство с языками программирования (семинары)

Урок 5. Функции и одномерные массивы


Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.

[345, 897, 568, 234] -> 2

Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

[3, 7, 23, 12] -> 19

[-4, -6, 89, 6] -> 0

Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.

[3 7 22 2 78] -> 76


ex_34


//объявляем массив
int [] array = new int [3];

//функция создания массива

int ArraySize(string text)
{
	Concole.WriteLine(text);
	int size = Int32.Parse(Concole.ReadLine());
	return size;
}

//функция генерации значений массива
int [] ArrGenerate (int size)
{
	int [] array = new int [size];
	for (int i = 0; i < size; i++)
		{
			array[i] = new Random().Next(100,1000);
		}
	return array;
}

//функция вывода кол-ва четных чисел

int Count (int [] array)
{
	int count = 0;
	for (int i = 0; i < array.Lenght; i++)
		{
		if (array [i] % 2 == 0)
			{
			count ++;	
			}
		}
	return count;	
}

int arrSize = ArraySize("Введите размер массива");
int [] array = ArrGenerate (arrSize);
int count = Count (array);
Console.WriteLine($"{String.Join(array)} - > {count}";